{
    "zoom": 1,
    "posX": 0,
    "posY": 0,
    "space": 0,
    "image": "00-empty-test.jpg",
    "imageIndex": 0,
    "nbOfImg": 0,
    "imagesglitch": [],
    "txtlong": "#### Bern, 8th September 2016\n\nDearest reader,\n\nAfter having spent three days on the first floor of the Natural History Museum, we are ready to write you this first letter describing the nature of this publication. If you have never heard of an ‘algoliterary publication’, you might be eager to read on. \n\nBecause, yes, this is an algoliterary publication. You will not find this adjective in an English dictionary, and with some luck you might stumble upon it in your search machine engine. We invented this word because we felt the need to define a practice of creating literary works using public domain texts and algorithms in Free Libre Open Source Code. This is code that can be read in the same way as this publication, it can be adapted to your needs, such as this publication and you can redistribute your adapted code using the same license, as you can with this publication.\n\n// picture of PJ machine //\n\nThis is also a live publication. If you feel like it, you can change the pages of this book, add new chapters, and rebuilt the PJ-machine we used over the last three days to make it. \nPJ’ing is another word you will not find in an English dictionary, nor in your search machine hits. In analogy to Dj’ing and VJ’ing, PJ’ing is a way to make publications on the fly. This machine, created for the occasion of the festival, is the first we know of that is so easy to use. The console with the colourful buttons is connected to a folder in which all of us share texts and images. By hitting the buttons, you compose your own page. If you are happy with the result, the green button will convert your page to a pdf that can be printed immediately.\n\nOver to the content!\nFor this book in the context of the Mad Scientist Festival, we chose to enjoy the two historical events that take place this year. \nOn the one hand, there is the 200th anniversary of Mary Shelly’s novel. We decided to stay the closest possible to the original text for our own explorations. And we all fell in love with her description of how the monster learns language. This is the only part of the novel that is told from the perspective of the monster, attributing it with (very humanized) thoughts, experiences, feelings. The process Shelly describes inspired us to look into natural language processing techniques that are intensively developed these days to create artificial intelligences of all sorts. In this book you will find a tiny selection of these techniques, ranging from straightforward practices of changing and substituting words to the almost ‘mystical’ practice of neural network techniques. Every chapter introduces a different technique.\nNot only Mary Shelly is celebrated. 2016 is also the year in which Eliza, the first convincing chatterbot, celebrates its 50th anniversary. Indeed, in 1966 American computer scientist Joseph Weizenbaum, fooled his audience by creating a bot that would answer your questions in the way of a rogerian therapist. A myriad of websites is out there to try Eliza, the computer therapist. As a reverence to this invention, and because chatterbots have the power to create this space in which AI can manifest itself in a personal conversation, we chose to use chatterbots to look into contemporary Frankenstein creatures. But we did not include Eliza, if the monster would have had an Eliza bot to talk to, the story might have ended radically different.\n\nMary Shelly let her monster disappear in the mist… Imagine it would have survived over the 200 years. Imagine it would have overcome its frustrations of being rejected by people. It would have abandoned natural language for sure. It would have gone beyond. That is where we end our publication, in the knowledge that some Ais of today will definitely go beyond.\n\n\n\n",
    "longIndex": 3,
    "nbOfLong": 3,
    "txtshort": "Algolit was coined in 2012, as the name of a workgroup of Constant, an organisation for arts and media in Brussels, with a focus on free software and free culture. From 2012 onwards, media artists/writers started to meet on a regularly basis in Brussels, to share their work, discuss and experiment together. The group is multidisciplinary, including fiction writers, visual artists, designers, statisticians, programmers.\n\n",
    "shortIndex": 2,
    "nbOfShort": 2,
    "fontwords": [],
    "black": true
}