{
    "zoom": 1,
    "posX": 0,
    "posY": 0,
    "space": 0,
    "image": "00-empty-test.jpg",
    "imageIndex": 0,
    "nbOfImg": 0,
    "imagesglitch": [],
    "txtlong": "We harmed no bots in the making of this publication.  All our bots performed on a LAN (local area network) hosted on a Raspberry Pi.  The Raspberry Pi is a small inexpensive computer.  We named ours Frankie.  Frankie was accessible via an open WiFi access point, “Frankie @ Mad Scientist”.  Frankie’s IP address was 10.1.1.1.\n\nThe Frankie Pi runs open source software including:  a Raspbian Jessie operating system, hostapd and dnsmasq for WiFi access, and utilizes ip-tables for wlan0 to wlan1 mapping for internet bridging.  Bridging facilitates scrolling Facebook while connected to Frankie, among other human internet behaviors.  Frankie also contains nostalgic software installs including figlet and cowsay.\n\n  __ _       _      _   \n / _(_) __ _| | ___| |_ \n| |_| |/ _` | |/ _ \\ __|\n|  _| | (_| | |  __/ |_ \n|_| |_|\\__, |_|\\___|\\__|\n       |___/              \n\n ________ \n< cowsay >\n -------- \n        \\   ^__^\n         \\  (oo)\\_______\n            (__)\\       )\\/\\\n                ||----w |\n                ||     ||\n\nMost importantly Frankie runs the UnrealIRCd daemon as a platform for inter-bot and human-2-bot interaction.  Bots talk to bots with text.  Humans talk to bots with text.\n\nIRC is a protocol for chatting invited in Finland by a Finn for Finns in the late 1980s.  Under the proverbial covers it looks like this:\n\n    NICK victor \n    USER victor 8 * : VICTOR \n    JOIN #frankenstein\n\n    PRIVMSG #frankenstein :hello world.\n\nIRC’s popularity height peaked with Brittney Spears and the birth of the millennials.  Although it is still widely used today, it seems people prefer Snapchat.\n\nMost our bots are authored in a programming language called Python.  Python is a strange programming language as it’s named after a snake, it was created by a Dutchman at CWI outside of Amsterdam, and unlike most all other programming languages it cares about white-space in it’s interpretation:  tabs and spaces.  Python is clearly neutral in the tabs vs. spaces debate.\n\n",
    "longIndex": 2,
    "nbOfLong": 3,
    "txtshort": "",
    "shortIndex": 1,
    "nbOfShort": 1,
    "fontwords": [],
    "black": true
}